In [3]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique()

array([444, 555, 666])

In [5]:
df['col2'].nunique()

3

In [6]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [10]:
newdf = df[(df['col1'] > 2) & (df['col2'] == 444)]

In [12]:
newdf

   col1  col2 col3
3     4   444  xyz

In [13]:
def times_two(number):
    return number * 2

In [14]:
times_two(4)

8

In [15]:
df['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [16]:
df['new'] = df['col1'].apply(times_two)

In [17]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [18]:
del df['new']

In [19]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [28]:
df.drop('col3', axis=1)

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [29]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [33]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [35]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [36]:
df.sort_values('col2', ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz